# Сума двох чисел: Написати програму, яка зчитує два цілих числа та виводить їх суму.

# a = int(input("Enter first number: "))
# b = int(input("Enter second number: "))
# print("Sum:", a + b)

# Гіпотенуза: За двома катетами прямокутного трикутника знайти довжину його гіпотенузи.

# a = int(input("Enter first number: "))
# b = int(input("Enter second number: "))
# print("hypotenuse:", (a + b) / 2)

# Двічі: Написати програму, яка зчитує ціле число та виводить його двічі.

# a = int(input("Enter first number: "))
# print("Here is your number: ", a)
# print("And again: ", a)

# Привіт, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить привітання.

# print("I require your name!",)
# a = input()
# print("Greetings, servant " + a + "!")

# Прощавай, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить прощання.

# print("Identify youself",)
# a = input()
# print("Farewell, human " + a + "!")

# Вік через рік: Напишіть програму, яка запитує ім'я користувача та його вік. Потім виведіть повідомлення,
# яке повідомляє, скільки йому буде років через рік.

# print("Name?",)
# a = input()
# print("Age?",)
# b = input()
# print("In one year," + a + "you will be" + (b + 1) +".")

# Площа прямокутника: Напишіть програму, яка запитує довжину та ширину прямокутника,
# а потім обчислює та виводить його площу.
# a = int(input("Enter length of rectangle in cm: "))
# b = int(input("Enter width of rectangle in cm: "))
# print ("Area of the rectangle is " + str(a * b) + "cm²")

#Конвертер валют: Запропонуйте користувачеві ввести суму в одній валюті (наприклад, доларах),
# а потім виведіть цю суму в іншій валюті (наприклад, євро), використовуючи заздалегідь
#визначений коефіцієнт обміну.

# k = 0.86
# print("Enter your sum in $",)
# a = int(input())
# b = a / k
# print("You will get " + str(b) + "€")

#Вартість покупки: Запитайте користувача назву товару, його ціну та кількість.
# Обчисліть загальну вартість покупки та виведіть її на екран.

# print("Enter product title",)
# a = input()
# print("Enter " + a + " price in €",)
# b = int(input())
# print("Enter amount",)
# c = int(input())
# print ("Price in total is " + str(b * c) + "€")

#Температура: Напишіть програму, яка перетворює температуру з градусів Цельсія на Фаренгейт.
# Запитайте користувача температуру в градусах Цельсія.

# print("Enter temperature in °C",)
# a = int(input())
# print ("Temperature is " + str((a * 9 / 5) + 32) + "°F")

#Задача 1. Середнє трьох чисел Користувач вводить три числа.
# Обчисли середнє арифметичне.
# a = int(input("Enter 1st number: "))
# b = int(input("Enter 2st number: "))
# c = int(input("Enter 3st number: "))
# print ("Serednie Aryfmety4ne " + str((a + b + c) / 3))

#Задача 2. Остача від ділення Користувач вводить два числа.
# Знайди остачу від ділення першого на друге.

#Задача 3. Подвоєне число Користувач вводить число. Виведи подвоєне значення цього числа.
#Задача 4. Конвертація хвилин у секунди Користувач вводить кількість хвилин. Обчисли, скільки це буде секунд.
#Задача 5. Кількість яблук на кожного Є n яблук і k учнів. Скільки яблук отримає кожен учень, якщо ділити порівну, і скільки залишиться?
#Задача 6. Остання цифра числа Користувач вводить число. Виведи його останню цифру.
#Задача 7*. Обмін змінних Користувач вводить два числа. Після цього потрібно “поміняти” їх місцями і вивести

# n1 = int(input("Enter first number: "))
# n2 = int(input("Enter second number: "))
# n1, n2 = n2, n1
# print(n1, n2)





