# 11. На стадіоні є три категорії місць для сидіння: місця класу A коштують a грошових одиниць, місця класу B коштують b грошових одиниць, а місця класу C - c грошових одиниць. Напишіть першу функцію, яка запитує скільки продано квитків на кожний клас місць, і другу функцію, яка відображає суму отриманого доходу від продажу квитків на кожен клас окремо і загалом. Формати введення і виведення такі, як у вхідних і вихідних даних.
# Вхідні дані:

# A
# 20.50
# 45
# B
# 15.75
# 30
# C
# 10.55
# 15
# Вихідні дані:

# ({'A': 922.5, 'B': 472.5, 'C': 158.25}, 1553.25)

def get_ticket_data():
    tickets = {}
    # символ _ который можно исп вместо переменной

    for _ in range(3):
        category = input("category: ").strip()
        price = float(input("price: ").strip())
        sold = int(input("sold: ").strip())
        tickets[category] = (price, sold)
    return tickets

print(get_ticket_data())

def calculate_revenue(tickets):
    tickets_by_class = {}
